/**
 *
 * @author     richen
 * @copyright  Copyright (c) 2016 - <richenlin(at)gmail.com>
 * @license    MIT
 * @version    16/1/22
 */
export default{
    400: '错误请求',
    401: '未授权',
    403: '请求被禁止',
    404: '资源未找到',
    405: '方法被禁用',
    406: '请求不被接受',
    407: '需要代理授权',
    408: '请求超时',
    409: '冲突',
    410: '资源已删除',
    411: '需要有效长度',
    412: '未满足前提条件',
    413: '请求实体过大',
    414: '请求的 URI 过长',
    416: '请求范围不符合要求',
    500: '服务器内部错误',
    501: '尚未实施',
    502: '错误网关',
    503: '服务不可用',
    504: '网关超时',
    505: 'HTTP 版本不受支持'
}
